# Імпортувати бібліотеку pygame (ігровий рушій)
import pygame
# Імпортувати всі налаштування (ширина, висота, кольори, шляхи тощо)
from settings import*
# Імпортувати клас кнопки
from buttons import Button
# Імпортувати функцію генерації кнопок з випадковими літерами
from random_letters import generat_btn
# Імпортувати генератор випадкових чисел
from random import randint
# Імпортувати класи гравця і ворога

# Запустити ініціалізацію pygame
pygame.init()

# Створити функцію для старту гри
# Змінити стан гри на "гра"
def start_game():
    global game_part
    game_part = "game"

# Створити функцію для перезапуску гри
# Дозволити змінювати глобальні змінні
# Перевести гру в стан "гра"
# Згенерувати новий набір кнопок (3–15 випадкових)
# Створити нового гравця на стартовій позиції
# Створити нового ворога на початковій позиції
def restart():
    ...

# Створити головне вікно гри з заданими розмірами
# Встановити назву вікна
# Завантажити фон з папки зображень
# Масштабувати фон під розмір вікна
window = pygame.display.set_mode((WIDTH,HEIGHT))
pygame.display.set_caption("key train")
fon = pygame.image.load(FON)
fon = pygame.transform.scale(fon,(WIDTH,HEIGHT))
# Створити таймер гри
clock = pygame.time.Clock()

# Створити кнопку старту
# Згенерувати кнопки з літерами випадкової довжини
btns = generat_btn(randint(3,15))
# Створити гравця
# Створити ворога
start_btn = Button(200,200,200,60,BLUE,
                   "start",WHITE,command = start_game)
# Створити кнопку кінця гри
# Створити кнопку перезапуску гри


# Увімкнути головний цикл гри
# Встановити початковий стан меню
# Змінна, яка визначає перемогу або поразку
run = True
game_part = "start"
end_game = "win"

# Почати нескінченний цикл гри
# Малювати фон на кожному кадрі
# Перевіряти всі події (клавіатура, миша, закриття)
# Якщо натиснули закрити вікно — завершити гру
# Якщо є кнопки на екрані
# Якщо користувач натиснув правильну клавішу — видалити кнопку
while run :
    window.blit(fon,(0,0))
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            run = False

# Якщо гра в меню
# Намалювати кнопку старту
# Перевірити, чи натиснули кнопку старту
    if game_part== "start":
        start_btn.draw(window)
        start_btn.is_clicked()




# Якщо гра активна
# Намалювати всі кнопки літер
# Оновити гравця (рух, взаємодія)
# Оновити ворога
# Якщо гравець зіткнувся з ворогом
# Перейти в екран кінця гри
# Позначити програш
# Якщо гравець дійшов до кінця рівня
# Перейти в екран кінця гри
# Позначити перемогу
    if game_part == "game":
        for btn in btns:
            btn.draw(window)

# Якщо гра закінчилась
# Якщо гравець виграв
# Показати текст перемоги
# Якщо програв
# Показати текст поразки
# Оновити текст кнопки результату
# Намалювати кнопку результату
# Намалювати кнопку рестарту
# Перевірити натискання рестарту


# Оновити екран (показати всі зміни)
# Обмежити FPS гри
    pygame.display.flip()
    clock.tick(FPS)