# Імпортувати базовий клас Sprite для створення об’єктів гри
from buttons import Sprite

# Імпортувати функції для роботи з зображеннями pygame
from pygame import image,transform
# Імпортувати всі налаштування гри (шляхи, константи тощо)
from settings import*

# Створити клас Player (гравець), який наслідує Sprite
# Оголосити конструктор гравця з координатами, розміром, швидкістю та зображеннями
# Викликати конструктор батьківського класу Sprite з параметрами гравця
# Завантажити всі зображення для анімації гравця
# Встановити перше зображення як поточне
# Ініціалізувати лічильник кадрів для анімації
class Player (Sprite):
    def __init__(self, x=10, y=10, w=50, h=50, speed=0, images= []) :
        super().__init__(x, y, w, h, speed, images [0], None)
        self.frame = 0
        self.count = 0
        self.images = images

# Створити функцію завантаження зображень
# Ініціалізувати список зображень
# Для кожного файлу зображення:
# Завантажити картинку з папки
# Масштабувати її під розмір гравця
# Додати у список анімацій
    

# Створити функцію анімації
# Збільшити лічильник кадрів
# Якщо пройшло достатньо кадрів:
# Перейти до наступного зображення
# Якщо дійшли до кінця списку — повернутись на початок
# Оновити поточне зображення
# Скинути лічильник кадрів
    def anime(self):
        self.count +=1
        if self.count >=20:
            self.count = 0
            self.frame += 1
            if self.frame == len(self.images):
                self.frame = 0
            self.image = self.images[self.frame]
            self.load_img() 
# Створити функцію руху гравця
# Перевірити зіткнення з усіма кнопками
# Якщо є зіткнення — не рухати гравця
# Якщо зіткнення немає — рухати гравця вперед
    def move(self, btns):
        for btn in btns:
            if self.rect.colliderect(btn.rect):
                return
        self.rect.x += self.speed



# Створити функцію оновлення гравця
# Намалювати гравця на екрані
# Виконати рух гравця
# Виконати анімацію


# Створити клас Enemy (ворог), який наслідує Player
# Оголосити конструктор ворога з параметрами
# Викликати конструктор батьківського класу
# Створити змінну кроку для таймера руху


# Створити функцію оновлення ворога
# Намалювати ворога на екрані
# Виконати рух ворога
# Виконати анімацію


# Створити функцію руху ворога
# Збільшити лічильник кроків
# Якщо пройшов певний час:
# Зсунути ворога вперед
# Скинути лічильник кроків