from customtkinter import CTkButton, CTkLabel, CTkFrame, CTkScrollableFrame
from settings import *
import os
import sounddevice as sd
from scipy.io import wavfile


# ================= МЕНЮ =================
'''НОВЕ:Напиши клас вікна записів караоке'''
class RecordsFrame(CTkFrame):
    def __init__(self, app):
        super().__init__(app, fg_color="transparent")

        self.app = app

        # НОВЕ: Додай кнопку 🔙 кнопка назад (верхній правий кут) 
        # текст "⬅️"б розмір 60 на 40 колір "#3c80bc" та "#061076"
        # команда self.app.back 
        # розаташування place(relx=1.0, x=-10, y=10, anchor="ne")


        self.pack(fill="both", expand=True) 
        # заголовок - лейбл текст "Записи каракоке:", колір "#b89bc6", шрифт 36 
        # розташуй pack(pady=(40, 10))
        
        #НОВЕ: створи вікно скролінгу для відображення записів віджет CTkScrollableFrame 
        # фон "transparent" розташуй pack(fill="both", expand=True) 
       

        #НОВЕ:викли метод додавання лейблів та кнопок пісень-записів
        
        #НОВЕ: властивість прапор грає чи ні
        
        #НОВЕ:властивість з номером попереднього програваємого запису = 0
        
    #НОВЕ: Метод додати записи
    def add_records(self):
        #НОВЕ: спершу видали усі віджети зі скролінгу 
        # отримати віджети -self.scroll.winfo_children()
        #  видалити widget.destroy()
        

        #НОВЕ: отримати усі записи зі папки записів черх ос os.listdir

        #НОВЕ: лічильник для номеру запису = 0
        i = 0
        #НОВЕ: список записів порожній

        #НОВЕ: цикл переребору записів файлів

            #НОВЕ: створити лейбл кріпимо на скролінг текст = назва файлу 
            # колір"#b89bc6", шрифт 36
            

            #НОВЕ: кріпимо як сітку (grid) ряд = і, колонка 0, відступи 50, 10
            
            #НОВЕ: додати у спсиок
            
            #НОВЕ: додати кнопку грати до цього запису на скролінг 
            # текст "🔊", розмір 30 на 30, колір "#3c80bc" 
            # команада lambda file=file, i = i:self.play(file,i) 
            # кріпимо - ряд = і, колонка 2 вітсупи 20 10
            

            #НОВЕ: додати кнопку грати до цього запису на скролінг 
            # текст ="🗑️", розмір 30 на 30, колір "#3c80bc" 
            # команада lambda file=file : self.del_sound(file)
            # кріпимо - ряд = і, колонка 2 вітсупи 20 10

            #НОВЕ: збільшити лічильник і


    #НОВЕ: метод видалити пісню       
    def del_sound(self,sound):
        #НОВЕ: видаляємо файл з папки метод ос remove
        
        #НОВЕ: скинути лічильник попредньої псні на 0
        
        #НОВЕ: викликати метод доати пісні для онволення списку записів
        
        
    #НОВЕ: Метод грати     
    def play(self, sound, i):
        #НОВЕ: якщо ве грає - зупинити 

        #НОВЕ:прапор грає включити
        
        #НОВЕ:якщо в списку пісень більше ніж 2
        #НОВЕ:змінити колір попереднього віджета лейбла пісні на text_color= "#b89bc6"
        

        #НОВЕ:змінити колір віджета і лейбла пісні на text_color= "#3c80bc"
        
        #НОВЕ: зампятати обрану пісню 
        
        
        #НОВЕ: читаємо файд
        
        #НОВЕ:граємо файл
       
    


    