kazka = '''Врятуюсь від слів твоїх буду - ціла.
За рік образ не складу ціну я.
Горять мости горять і сліз моря.
Та знай, це гра моя менше слів - більше діла.

Врятую від слів твоїх хоч би тіло.
Загнав під лід не знайду душу я.
Болить, ой як болить і кров кипить.
Та донька вже не спить, менше слів - більше діла.

[Припев, KAZKA]:
Поплакала і знов фіалка розцвіла.
Засяяв день таємними знаками.
І мама молода й закохана мала.
На кухні всі однаково плакали.

[Куплет 2, KAZKA]:
Зотліла ніч, зранку все стало сіре.
Знайти нові кольори мушу я.
А лице умий дощем, що треба ще?
Хай серцю під плащем - менше слів, більше віри.

[Припев, KAZKA]:
Поплакала і знов фіалка розцвіла.
Засяяв день таємними знаками.
І мама молода й закохана мала.
На кухні всі однаково плакали.

Поплакала і знов фіалка розцвіла.
Засяяв день таємними знаками.
І мама молода й закохана мала.
На кухні всі однаково плакали.

Поплакала і знов фіалка розцвіла.
Засяяв день таємними знаками.
І мама молода й закохана мала.
На кухні всі однаково плакали.

Поплакала і знов фіалка розцвіла.
Засяяв день таємними знаками.
І мама молода й закохана мала.
На кухні всі однаково плакали.'''

drevo = '''Світанком біля моря, мрійним промінням сонця,
All up to you, all up to you..
На це хибує більшість, вірність бракує цінність,
All up to you, all up to you..

Приспів:
Смарагдове небо чекає нас завтра,
А я йду до тебе, я йду назад!
Смарагдове небо загадуй бажання,
А я йду до тебе, я йду назад!
Смарагдове небо,
Смарагдове небо,
Смарагдове небо!

2
Мені прислали пісню,
Немає більше місця.
В моєму злому серці,
Давно уже війна..
Давай забудем, де ми,
Пробудем всі проблеми!
Мені пора на сцену,
Сказати ці слова..
Приспів:

Бридж:
Смарагдове небо чекає нас завтра,
А я йду до тебе, я йду назад!
Смарагдове небо загадуй бажання,
А я йду до тебе!

Приспів:'''

elza = '''Шо ж це я, шо ж це я не зумів
Зупинитися вчасно, все ясно
Зі мною тепер і назавжди, пізно не йти
Не йди від мене

Я налию собі, я налию тобі вина
А хочеш із медом

Хто ти є? - Ти взяла моє життя
І не віддала
Хто ти є? - Ти випила мою кров
І п'яною впала

Твої очі, кличуть, хочуть мене
Ведуть за собою
Хто ти є? Й ким би не була ти

Припев:
Я не здамся без бою
Я не здамся без бою

Шо ж це я, шо ж це я не зумів
Зупинити себе, тебе... Сьогодні
Сьогодні так вив, без тебе сумую
Сумую без тебе, накинь шось на себе

Я налию собі, я налию тобі вина
А хочеш із медом

Хто ти є? - Ти взяла моє життя
І не віддала
Хто ти є? - Ти випила мою кров
І п'яною впала

Твої очі, кличуть, хочуть мене
Ведуть за собою
Хто ти є? Й ким би не була ти

Припев:
Я не здамся без бою
Я не здамся без бою

Проигрыш(вокал):

Я налию собі, я налию тобі вина
А хочеш із медом

Хто ти є? - Ти взяла моє життя
І не віддала
Хто ти є? - Ти випила мою кров
І п'яною впала

Твої очі, кличуть, хочуть мене
Ведуть за собою
Хто ти є? Й ким би не була ти

Припев:
Я не здамся без бою
Я не здамся без бою
Я не здамся без бою'''
kalush = '''Стефанія мамо мамо Стефанія
Розквітає поле, а вона сивіє
Заспівай мені мамо колискову
Хочу ще почути твоє рідне слово

Вона мене колисала дала мені ритм і напевне силу волі не забрати в мене, бо дала вона
Напевне знала може більше і від Соломона
Ламаними дорогами прийду я завжди до тебе
Вона не розбудить, не будить, мене в сильні бурі
Забере в бабулі дві дулі, ніби вони кулі
Дуже добре знала мене не була обманута, як була дуже втомлена, гойдала мене в такт
Люлі люлі люлі…

Стефанія мамо мамо Стефанія
Розквітає поле, а вона сивіє
Заспівай мені мамо колискову
Хочу ще почути твоє рідне слово

Я не в пеленах но ма но ма, хватить, як би я не виріс на виріст за речі платить
Я не мала дитина, вона далі нерви тратить, я гуляв, шляк би тебе трафив
Ти все молода о мамо на піку, якщо не ціню опіку на піку слави мені в тупику
Забивайте піку цю піку, я би попік спік, своєю любов’ю
Люлі люлі люлі…

Стефанія мамо мамо Стефанія
Розквітає поле, а вона сивіє
Заспівай мені мамо колискову
Хочу ще почути твоє рідне слово

Стефанія мамо мамо Стефанія
Розквітає поле, а вона сивіє
Заспівай мені мамо колискову
Хочу ще почути твоє рідне слово'''
wellboy = '''Знаєш, мене не бісе вже хруст пальців
І купа копійок в моїй кишені
Я просто хочу подивитися у вічі
Попасти в самий-самий центр у мішені
Знаєш, мене ти більше не вставляєш
І гуси-гуси в вирій розлетілись
І я не жив, я формував тут свою душу
Ви не схотіли

Ми з тобою на короткій
З мене спліф, а з тебе — водка
Ріхтер грає Баха на пластинці
Ще поки не їдь додому
На таксі чи своїм ходом
Твій прихід співпав з моїм приходом
Пр-в:
Ми йдемо на різні туси
І відлетіли наші гуси
Під музику, під нотки блюзу
Знімаю вже не твою блузу
Ми йдемо на різні туси
І відлетіли наші гуси
Під музику, під нотки блюзу
Знімаю вже не твою блузу!
Знімаю вже не твою блузу!

Знаєш... і розійшлись наші дороги
Посипалися в різні боки, як лавина
Направо — мої, а наліво твої ноги
І цілого тепер моя ти половина
Знаєш, ти у цій грі мені програєш
І ми залишитись разом хотіли
Побачив очі я твої зелені в залі
І зрозумів, що наші гуси прилетіли
Пр-в'''

adam = '''Сьогодні Мила день буде прекрасним
і на морозі розцвітуть сади
і сонце нам світити буде ясно
все буде так як того схочем ми
Танцюй зі мною
Повільно
Хай зачекає
Світ Божевільний
Танцюй зі мною
Повільно
Бути щасливі ми повинні
Сьогодні Мила день буде як треба
і в темнім небі
Зорі спалахнуть
а потім нам з тобою якщо треба
вони із неба в руки упадуть
Танцюй зі мною
Повільно
Хай зачекає
Світ Божевільний
Танцюй зі мною
Повільно
Бути щасливі ми повинні'''

bezobmezen= '''Ти була лагідна як море,
Ти недосяжна наче небо,
Така цнотлива і прозора,
І сонце прохолодніше за тебе.

І всесвіт сяє твоїм світлом,
Відлуння в горах – шепіт твого сну,
А я, захочеш, стану вітром,
Зловити б тільки посмішку одну.

Приспів:

Чому так зорі запалали,
Зорі запалали, мені?
Чому так зорі запалали,
Зорі запалали, на весні?
Як нам зорі запалали,
Зорі запалали, ясні...

Коли туману вже не стало,
А сонце пробивається крізь сни,
Не прокидайся ще зарано,
Не прокидайся, трохи ще поспи.

Закрию промені собою,
Побудь зі мною прошепчу,
Дай я надихатись тобою,
Дай я намріюсь, досхочу

Приспів (2).'''

piv_dor = '''Думи... Думи мої, думи,
Лихо мені з вами!
Чом вас вітер не розвіяв?

Думи... Думи мої, думи,
Лихо мені з вами!

Там квіти мої, діти мої...
Чи заплаче серце одно
На світі усім, як і я з вами?

Думи... Думи мої, думи,
Лихо мені з вами!
Чом вас вітер не розвіяв?

Думи... Думи мої, думи,
Лихо мені з вами!

Моя, моя Україно!
Привітай же, ненько, ти
Свою, свою ти дитину
І думи мої, думи мої,
Думи мої, думи мої!

Мої думи!
Думи мої, мої думи!
Мої думи!
Думи мої, мої думи!
Мої думи!
Думи мої, мої думи!'''

minus_path = 'assets/'
record_path = 'assets/record/'
minus = ['kazka.wav','piv_dor.wav',
          'bezobmezen.wav','adam.wav',
          'drevo.wav','elza.wav', 
          'wellboy.wav', 'kalush.wav', ]
name_minus = [
    "Казка - Плакала",
    "Дорофєєва та Пивоваров - Думи",
    "Без Обмежень - Зорі запалали",
    "ADAM - Повільно",
    "DREVO - Смарагдове небо",
    "Океан Ельзи - Без бою",
    "Wellboy - Гуси",
    "Kalush - Стефанія"
]
texts= [
    kazka,
    piv_dor,
    bezobmezen,
    adam,
    drevo,
    elza,
    wellboy,
    kalush
]