# Встановити ширину та висоту ігрового вікна
WIDTH, HEIGHT = 600, 500

# Встановити розміри гравця (ширина і висота)
PLAYER_W, PLAYE_H = 80, 40

# Встановити розміри кнопок (літер у грі)
BTN_W, BTN_H = 30, 30

# Встановити розміри ворога (ширина і висота)
ENEMY_W, ENEMY_H = 160, 40

# Встановити початкову позицію для кнопок (X, Y)
BTN_X, BTN_Y = 150, 350

# Встановити загальну ширину області кнопок
BTNS_W = 400

# Встановити кількість кадрів за секунду (FPS гри)
FPS = 60


# Вказати шлях до фонового зображення
FON = "assets/fon.png"

# Вказати список зображень для анімації гравця
PLAYERS = ["assets/pl0.png","assets/pl1.png","assets/pl2.png","assets/pl3.png"]

# Вказати список зображень для анімації ворога
ENEMYS = ["assets/en0.png","assets/en1.png","assets/en2.png","assets/en3.png"]

# Вказати базову папку для всіх зображень
PATH_IMG = "assets/"


# Встановити колір синього (RGB)
BLUE = (33, 31, 94)

# Встановити сірий колір (RGB)
GREY = (128, 128, 128)

# Встановити чорний колір (RGB)
BLACK = (0, 0, 0)

# Встановити білий колір (RGB)
WHITE = (255, 255, 255)